InformationRegisters/ДоступностьШаблоновПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДоступностьШаблоновПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвтоматическийЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ШаблонПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступностьШаблоновПроцессов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Определим картинку доступности в коллекции: Общиекартинки.КоллекцияСветофор.
	Если Этотобъект.Количество() > 0 Тогда
		
		ЭлементОтбор = Отбор.Найти("Шаблон");
		Если ЭлементОтбор <> Неопределено
			И ЭлементОтбор.Использование
			И ЗначениеЗаполнено(ЭлементОтбор.Значение) Тогда
			
			Если Этотобъект[0].РучнойЗапуск И Этотобъект[0].АвтоматическийЗапуск Тогда
				Этотобъект[0].Картинка = 3;
			ИначеЕсли Этотобъект[0].РучнойЗапуск Тогда
				Этотобъект[0].Картинка = 2;
			Иначе
				Этотобъект[0].Картинка = 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
